e2e/playwright/fixtures/vcr_cassettes/btcpay_checkout_wallet_transfer.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/products?active=true&expand%5B%5D=data.default_price&ids%5B%5D=prod_SO9GmhAFidiukT&ids%5B%5D=prod_SOA4vfEvazoRti&ids%5B%5D=prod_SOA6phfwu0fqTR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/15.3.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      Stripe-Version:
      - 2025-06-30.basil
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"15.3.0","lang":"ruby","lang_version":"3.2.8 p263 (2025-03-26)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 6.6.87.2-microsoft-standard-WSL2 (root@439a258ad544) (gcc (GCC) 11.2.0,
        GNU ld (GNU Binutils) 2.37) #1 SMP PREEMPT_DYNAMIC Thu Jun  5 18:30:46 UTC
        2025","hostname":"DESKTOP-TTFCNJ3"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 15 Jul 2025 16:04:32 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4038'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=YdIyGoWjDvc37cRFq2GRoZ_1eiH5QgBCYIGc2Pw6qlmrrN1YQfeT9Ekt7cXg0_p4hOx59cs4AmZNsEYZ
      Request-Id:
      - req_vTgORP6zexp5Eb
      Stripe-Version:
      - 2025-06-30.basil
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "prod_SO9GmhAFidiukT",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748350230,
              "default_price": {
                "id": "price_1RTMxeIeDQzQhbSLlt6A80i8",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748350230,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": "6 envelopes + 12 credits",
                "product": "prod_SO9GmhAFidiukT",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 1900,
                "unit_amount_decimal": "1900"
              },
              "description": "6 envelopes + 12 credits",
              "images": [
                "https://files.stripe.com/links/MDB8YWNjdF8xTkJIYXRJZURRelFoYlNMfGZsX3Rlc3RfbHZkWW1vaFBZOGZsSk5qRzVocTkwUnNQ00HFJxTKXr"
              ],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "6",
                "slug": "mini",
                "tokens": "12"
              },
              "name": "Mini Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748497552,
              "url": null
            },
            {
              "id": "prod_SOA4vfEvazoRti",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353233,
              "default_price": {
                "id": "price_1RTNk5IeDQzQhbSLX9WPtg2z",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353233,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA4vfEvazoRti",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 2900,
                "unit_amount_decimal": "2900"
              },
              "description": "12 envelopes + 24 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "12",
                "slug": "family",
                "tokens": "24"
              },
              "name": "Family Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404142,
              "url": null
            },
            {
              "id": "prod_SOA6phfwu0fqTR",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353346,
              "default_price": {
                "id": "price_1RTNluIeDQzQhbSL0OFxGeT5",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353346,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA6phfwu0fqTR",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 3900,
                "unit_amount_decimal": "3900"
              },
              "description": "24 envelopes + 42 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "24",
                "slug": "maximalist",
                "tokens": "42"
              },
              "name": "Maximalist Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404159,
              "url": null
            }
          ],
          "has_more": false,
          "url": "/v1/products"
        }
  recorded_at: Tue, 15 Jul 2025 16:04:31 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/products?active=true&expand%5B%5D=data.default_price&ids%5B%5D=prod_SO9GmhAFidiukT&ids%5B%5D=prod_SOA4vfEvazoRti&ids%5B%5D=prod_SOA6phfwu0fqTR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/15.3.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_vTgORP6zexp5Eb","request_duration_ms":395}}'
      Stripe-Version:
      - 2025-06-30.basil
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"15.3.0","lang":"ruby","lang_version":"3.2.8 p263 (2025-03-26)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 6.6.87.2-microsoft-standard-WSL2 (root@439a258ad544) (gcc (GCC) 11.2.0,
        GNU ld (GNU Binutils) 2.37) #1 SMP PREEMPT_DYNAMIC Thu Jun  5 18:30:46 UTC
        2025","hostname":"DESKTOP-TTFCNJ3"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 15 Jul 2025 16:04:34 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4038'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=dqCMLz7MQKoFpGS6XoWoXLnBTPkR_EqWV1MqWWFKG3XwBYlOR2qm-x1MWj4CKvEMVzxzusKJpUc3ROpB
      Request-Id:
      - req_VoaSp912yUkQxZ
      Stripe-Version:
      - 2025-06-30.basil
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "prod_SO9GmhAFidiukT",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748350230,
              "default_price": {
                "id": "price_1RTMxeIeDQzQhbSLlt6A80i8",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748350230,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": "6 envelopes + 12 credits",
                "product": "prod_SO9GmhAFidiukT",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 1900,
                "unit_amount_decimal": "1900"
              },
              "description": "6 envelopes + 12 credits",
              "images": [
                "https://files.stripe.com/links/MDB8YWNjdF8xTkJIYXRJZURRelFoYlNMfGZsX3Rlc3RfbHZkWW1vaFBZOGZsSk5qRzVocTkwUnNQ00HFJxTKXr"
              ],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "6",
                "slug": "mini",
                "tokens": "12"
              },
              "name": "Mini Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748497552,
              "url": null
            },
            {
              "id": "prod_SOA4vfEvazoRti",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353233,
              "default_price": {
                "id": "price_1RTNk5IeDQzQhbSLX9WPtg2z",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353233,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA4vfEvazoRti",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 2900,
                "unit_amount_decimal": "2900"
              },
              "description": "12 envelopes + 24 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "12",
                "slug": "family",
                "tokens": "24"
              },
              "name": "Family Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404142,
              "url": null
            },
            {
              "id": "prod_SOA6phfwu0fqTR",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353346,
              "default_price": {
                "id": "price_1RTNluIeDQzQhbSL0OFxGeT5",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353346,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA6phfwu0fqTR",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 3900,
                "unit_amount_decimal": "3900"
              },
              "description": "24 envelopes + 42 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "24",
                "slug": "maximalist",
                "tokens": "42"
              },
              "name": "Maximalist Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404159,
              "url": null
            }
          ],
          "has_more": false,
          "url": "/v1/products"
        }
  recorded_at: Tue, 15 Jul 2025 16:04:34 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/products?active=true&expand%5B%5D=data.default_price&ids%5B%5D=prod_SO9GmhAFidiukT&ids%5B%5D=prod_SOA4vfEvazoRti&ids%5B%5D=prod_SOA6phfwu0fqTR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/15.3.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_VoaSp912yUkQxZ","request_duration_ms":375}}'
      Stripe-Version:
      - 2025-06-30.basil
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"15.3.0","lang":"ruby","lang_version":"3.2.8 p263 (2025-03-26)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 6.6.87.2-microsoft-standard-WSL2 (root@439a258ad544) (gcc (GCC) 11.2.0,
        GNU ld (GNU Binutils) 2.37) #1 SMP PREEMPT_DYNAMIC Thu Jun  5 18:30:46 UTC
        2025","hostname":"DESKTOP-TTFCNJ3"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 15 Jul 2025 16:04:36 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4038'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=dqCMLz7MQKoFpGS6XoWoXLnBTPkR_EqWV1MqWWFKG3XwBYlOR2qm-x1MWj4CKvEMVzxzusKJpUc3ROpB
      Request-Id:
      - req_e49pl2MF2VQdmz
      Stripe-Version:
      - 2025-06-30.basil
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "prod_SO9GmhAFidiukT",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748350230,
              "default_price": {
                "id": "price_1RTMxeIeDQzQhbSLlt6A80i8",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748350230,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": "6 envelopes + 12 credits",
                "product": "prod_SO9GmhAFidiukT",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 1900,
                "unit_amount_decimal": "1900"
              },
              "description": "6 envelopes + 12 credits",
              "images": [
                "https://files.stripe.com/links/MDB8YWNjdF8xTkJIYXRJZURRelFoYlNMfGZsX3Rlc3RfbHZkWW1vaFBZOGZsSk5qRzVocTkwUnNQ00HFJxTKXr"
              ],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "6",
                "slug": "mini",
                "tokens": "12"
              },
              "name": "Mini Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748497552,
              "url": null
            },
            {
              "id": "prod_SOA4vfEvazoRti",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353233,
              "default_price": {
                "id": "price_1RTNk5IeDQzQhbSLX9WPtg2z",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353233,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA4vfEvazoRti",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 2900,
                "unit_amount_decimal": "2900"
              },
              "description": "12 envelopes + 24 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "12",
                "slug": "family",
                "tokens": "24"
              },
              "name": "Family Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404142,
              "url": null
            },
            {
              "id": "prod_SOA6phfwu0fqTR",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353346,
              "default_price": {
                "id": "price_1RTNluIeDQzQhbSL0OFxGeT5",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353346,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA6phfwu0fqTR",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 3900,
                "unit_amount_decimal": "3900"
              },
              "description": "24 envelopes + 42 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "24",
                "slug": "maximalist",
                "tokens": "42"
              },
              "name": "Maximalist Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404159,
              "url": null
            }
          ],
          "has_more": false,
          "url": "/v1/products"
        }
  recorded_at: Tue, 15 Jul 2025 16:04:35 GMT
- request:
    method: post
    uri: https://testnet.demo.btcpayserver.org/api/v1/stores/5J8edsBQADQ17kfw2iLbQ23PX79Lbc1wTWGqwzCBm5rR/payment-requests
    body:
      encoding: UTF-8
      string: '{"amount":"19.0","currency":"EUR","title":"Mini Pack","description":"6
        envelopes + 12 credits","formId":"e0042b63-24e4-4d12-bfac-b91937c252b5","expiryDate":1752599075,"referenceId":"7fabdf1ac2d54256d76c_1"}'
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Host:
      - testnet.demo.btcpayserver.org
      Authorization:
      - token <BTCPAY_API_KEY>
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 15 Jul 2025 16:04:36 GMT
      Content-Type:
      - application/json; charset=utf-8
      Content-Length:
      - '433'
      Connection:
      - keep-alive
      Set-Cookie:
      - UserPrefsCookie=%7B%22InvoicesQuery%22%3Anull%2C%22PaymentRequestsQuery%22%3Anull%2C%22UsersQuery%22%3Anull%2C%22PayoutsQuery%22%3Anull%2C%22PullPaymentsQuery%22%3Anull%2C%22CurrentStoreId%22%3A%225J8edsBQADQ17kfw2iLbQ23PX79Lbc1wTWGqwzCBm5rR%22%7D;
        path=/
      Content-Security-Policy:
      - script-src 'self'
      Referrer-Policy:
      - same-origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      Strict-Transport-Security:
      - max-age=31536000
    body:
      encoding: UTF-8
      string: '{"storeId":"5J8edsBQADQ17kfw2iLbQ23PX79Lbc1wTWGqwzCBm5rR","amount":19.0,"currency":"EUR","expiryDate":1752599075,"title":"Mini
        Pack","description":"6 envelopes + 12 credits","email":null,"referenceId":"7fabdf1ac2d54256d76c_1","allowCustomPaymentAmounts":false,"status":"Pending","createdTime":1752595476,"id":"1e4f74d3-86a4-4971-bd21-d524132f729e","archived":false,"formId":"e0042b63-24e4-4d12-bfac-b91937c252b5","formResponse":null}'
  recorded_at: Tue, 15 Jul 2025 16:04:35 GMT
recorded_with: VCR 6.3.1
